In [1]:
import numpy as np
import pandas as pd

In [2]:
data={"Names":['Jay','rahul',np.nan,'rahul'],
      'Age':[np.nan,23,22,21],
      'City':['Hyd','Blr','Pune',np.nan]}

In [7]:
df=pd.DataFrame(data)
df

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3  rahul  21.0   NaN

In [9]:
df.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [10]:
df.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [13]:
df.fillna(40,inplace=True)
df

   Names   Age  City
0    Jay  40.0   Hyd
1  rahul  23.0   Blr
2     40  22.0  Pune
3  rahul  21.0    40

In [16]:
df=pd.DataFrame(data)
df

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3  rahul  21.0   NaN

In [22]:
df['Names'].fillna('Krish',inplace=True)
df['Age'].fillna(20,inplace=True)
df['City'].fillna('Chennai',inplace=True)

In [23]:
df

   Names   Age     City
0    Jay  20.0      Hyd
1  rahul  23.0      Blr
2   Raju  22.0     Pune
3  rahul  21.0  Chennai

In [28]:
data={"Names":['Jay','rahul',np.nan,'raju'],
      'Age':[np.nan,23,22,21],
      'City':['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3   raju  21.0   NaN

In [40]:
df.fillna(method='pad',axis=0)

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2  rahul  22.0  Pune
3   raju  21.0  Pune

In [31]:
df.fillna(method='backfill')

   Names   Age  City
0    Jay  23.0   Hyd
1  rahul  23.0   Blr
2   raju  22.0  Pune
3   raju  21.0   NaN

In [35]:
df.fillna(method='bfill')

   Names   Age  City
0    Jay  23.0   Hyd
1  rahul  23.0   Blr
2   raju  22.0  Pune
3   raju  21.0   NaN

In [36]:
df.fillna(method='ffill')

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2  rahul  22.0  Pune
3   raju  21.0  Pune

In [ ]:
'backfill', 'bfill', 'pad', 'ffill', None

In [41]:
data={"Names":['Jay','rahul',np.nan,'raju'],
      'Age':[np.nan,23,22,21],
      'City':['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3   raju  21.0   NaN

In [42]:
df.fillna(method='pad',axis=1)

   Names   Age  City
0    Jay   Jay   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3   raju  21.0  21.0

In [43]:
data={"Names":['Jay','rahul',np.nan,'raju'],
      'Age':[np.nan,23,22,21],
      'City':['Hyd','Blr','Pune',np.nan]}
df=pd.DataFrame(data)
df

   Names   Age  City
0    Jay   NaN   Hyd
1  rahul  23.0   Blr
2    NaN  22.0  Pune
3   raju  21.0   NaN

In [45]:
mean_age=df['Age'].mean()
mean_age

22.0

In [46]:
df['Age'].fillna(mean_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Age, dtype: float64

In [47]:
med=df['Age'].median()
df['Age'].fillna(med)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Age, dtype: float64